<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="onnx::Gather_0" type="Parameter" version="opset1">
			<data shape="1,2,33,201" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Gather_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_60711_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="0" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_60711" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_60708_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="512" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_60708" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_60702_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="640" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_60702" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_60698_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="1152" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_60698" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_60695_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="1664" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_60695" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_60689_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="1792" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_60689" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_60685_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="2304" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_60685" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_60682_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="2816" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_60682" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_60676_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="2944" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_60676" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_60672_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="3456" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_60672" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_60669_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="3968" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_60669" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_60663_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="4096" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_60663" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_60659_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="4608" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_60659" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_60656_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="5120" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_60656" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_60650_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="5248" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_60650" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_60646_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="5760" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_60646" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_60643_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="6272" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_60643" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_60637_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="6400" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_60637" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_60633_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="6912" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_60633" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_60630_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="7424" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_60630" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_60624_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="7552" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_60624" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_60620_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="8064" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_60620" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_60617_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="8576" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_60617" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_60611_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="8704" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_60611" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="9216" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="50" name="Constant_201" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="9224" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="51" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_output_0">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_60608_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="9232" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_60608" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Pow_output_0">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="9224" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="56" name="Constant_205" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="9224" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_1_output_0">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_60609_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="9234" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_60609" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/Pow_1" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Pow_1_output_0">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Sqrt_output_0">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="9224" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="dense_encoder.conv_1.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 3, 1, 1" offset="9236" size="384" />
			<output>
				<port id="0" precision="FP16" names="dense_encoder.conv_1.0.weight">
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="dense_encoder.conv_1.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/dense_encoder/conv_1/conv_1.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_239_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="9620" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_239" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/dense_encoder/conv_1/conv_1.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/conv_1/conv_1.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_241" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="9748" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="MVN_242" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/conv_1/conv_1.1/InstanceNormalization_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::PRelu_2652_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1, 1" offset="9764" size="128" />
			<output>
				<port id="0" precision="FP16" names="onnx::PRelu_2646,onnx::PRelu_2652,onnx::PRelu_2658,onnx::PRelu_2664,onnx::PRelu_2670,onnx::PRelu_2671,onnx::PRelu_2813,onnx::PRelu_2819,onnx::PRelu_2825,onnx::PRelu_2831,onnx::PRelu_2841,onnx::PRelu_2847,onnx::PRelu_2853,onnx::PRelu_2859,onnx::PRelu_2867">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="onnx::PRelu_2652" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/dense_encoder/conv_1/conv_1.2/PRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/conv_1/conv_1.2/PRelu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="dense_encoder.dilated_dense.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 2, 3" offset="9892" size="49152" />
			<output>
				<port id="0" precision="FP16" names="dense_encoder.dilated_dense.conv1.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="dense_encoder.dilated_dense.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/dense_encoder/dilated_dense/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_307_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="59044" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_307" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/dense_encoder/dilated_dense/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/conv1/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_309" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="9748" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="MVN_310" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/norm1/InstanceNormalization_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/dense_encoder/dilated_dense/prelu1/PRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/prelu1/PRelu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/dense_encoder/dilated_dense/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/Concat_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="dense_encoder.dilated_dense.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 128, 2, 3" offset="59172" size="98304" />
			<output>
				<port id="0" precision="FP16" names="dense_encoder.dilated_dense.conv2.weight">
					<dim>64</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="dense_encoder.dilated_dense.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/dense_encoder/dilated_dense/conv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="2, 1" pads_begin="2, 1" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_376_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="157476" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_376" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/dense_encoder/dilated_dense/conv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/conv2/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_378" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="9748" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="MVN_379" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/norm2/InstanceNormalization_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/dense_encoder/dilated_dense/prelu2/PRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/prelu2/PRelu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/dense_encoder/dilated_dense/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/Concat_1_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="dense_encoder.dilated_dense.conv3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 192, 2, 3" offset="157604" size="147456" />
			<output>
				<port id="0" precision="FP16" names="dense_encoder.dilated_dense.conv3.weight">
					<dim>64</dim>
					<dim>192</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="dense_encoder.dilated_dense.conv3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>192</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/dense_encoder/dilated_dense/conv3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="4, 1" pads_begin="4, 1" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape_445_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="305060" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_445" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/dense_encoder/dilated_dense/conv3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/conv3/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_447_2" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="9748" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="MVN_448" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/norm3/InstanceNormalization_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/dense_encoder/dilated_dense/prelu3/PRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/prelu3/PRelu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/dense_encoder/dilated_dense/Concat_2" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/Concat_2_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="dense_encoder.dilated_dense.conv4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 256, 2, 3" offset="305188" size="196608" />
			<output>
				<port id="0" precision="FP16" names="dense_encoder.dilated_dense.conv4.weight">
					<dim>64</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="dense_encoder.dilated_dense.conv4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/dense_encoder/dilated_dense/conv4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="8, 1" pads_begin="8, 1" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Reshape_514_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="501796" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Reshape_514" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/dense_encoder/dilated_dense/conv4/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/conv4/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_516" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="9748" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="MVN_517" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/norm4/InstanceNormalization_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/dense_encoder/dilated_dense/prelu4/PRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/dense_encoder/dilated_dense/prelu4/PRelu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>33</dim>
					<dim>201</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="dense_encoder.conv_2.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 1, 3" offset="501924" size="24576" />
			<output>
				<port id="0" precision="FP16" names="dense_encoder.conv_2.0.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="dense_encoder.conv_2.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
